{"Carbohydrate, by difference in gram": ["The primary function of carbohydrates is to provide the body with energy. After consumption, carbohydrates (also named carbs) are broken down into glucose. This glucose can then be used to produce ATP (adenosine triphosphate), which can be seen as fuel for the cells in the body. Even though ATP can be produced from different nutrients (for example protein and fats), it is easiest for the body to produce ATP from carbohydrates. ", "If you consume more carbs than your body requires, these carbs will be transformed into glycogen. The glycogen reserves of your body are mostly stored in your liver and muscles, and ensure the presence of fuel for the body in between meals. However, once your glycogen reserves are filled and you consume carbs, the body will convert these carbs into body fat. Systematically consuming too much carbohydrates can thus make you overweight!", "Systematically consuming too little carbs will cause to body to go into a state of ketosis. Ketosis is a state where your body fuels itself with ketones instead of glucose. Ketones can be extracted by the body from protein and fats. Even though the brain can largely function on ketones, it still requires some degree of glucose to maintain full function. Being fully deprived of carbs will therefore cause the conversion of muscle mass and fat tissue into glucose. Because of this fat loss, many people try to lose weight by carbohydrate deprivation. There is no evidence of carbohydrate deprivation being harmful to the human body, unless your body fat percentage is at such a low level that it cannot convert into glucose anymore."], "Energy in kcal": "energy", "Fiber, total dietary in gram": "fiber", "Folate, DFE in microgram": "Folate", "Iron, Fe in milligram": "Iron", "Magnesium, Mg in milligram": "Magnesium", "Niacin in milligram": "Niacin", "Phosphorus, P in milligram": "Phospor", "Potassium, K in milligram": "Potassium", "Riboflavin in milligram": "Riboflavin", "Sugars, total in gram": "Sugars", "Thiamin in milligram": "Thiamin", "Vitamin A, RAE in microgram": "Vit A", "Vitamin B-6 in milligram": "Vit B", "Vitamin C, total ascorbic acid in milligram": "Vit C"}